vsnam19/bootloader-mcp/MKL46Z4/hardware_MKL46Z4.h
/*!
 * @file hardware_MKL46Z.h
 * @version 3.4
 * @date 2014-10-14
 * @brief CMSIS Peripheral Access Layer for MKL46Z4
 *
 * CMSIS Peripheral Access Layer for MKL46Z4
 */

#ifndef _HARDWARE_MKL46Z4_H_
#define _HARDWARE_MKL46Z4_H_

/******************************************************************************
 * Includes
 *****************************************************************************/

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0300U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0004U

#define REGISTER_SIZE (4u)

/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 48 /**< Number of interrupts in the Vector table */

typedef enum IRQn
{
   /* Auxiliary constants */
   NotAvail_IRQn = -128, /**< Not available device specific interrupt */

   /* Core interrupts */
   NonMaskableInt_IRQn = -14, /**< Non Maskable Interrupt */
   HardFault_IRQn = -13,      /**< Cortex-M0 SV Hard Fault Interrupt */
   SVCall_IRQn = -5,          /**< Cortex-M0 SV Call Interrupt */
   PendSV_IRQn = -2,          /**< Cortex-M0 Pend SV Interrupt */
   SysTick_IRQn = -1,         /**< Cortex-M0 System Tick Interrupt */

   /* Device specific interrupts */
   DMA0_IRQn = 0,         /**< DMA channel 0 transfer complete and error interrupt */
   DMA1_IRQn = 1,         /**< DMA channel 1 transfer complete and error interrupt */
   DMA2_IRQn = 2,         /**< DMA channel 2 transfer complete and error interrupt */
   DMA3_IRQn = 3,         /**< DMA channel 3 transfer complete and error interrupt */
   Reserved20_IRQn = 4,   /**< Reserved interrupt */
   FTFA_IRQn = 5,         /**< FTFA command complete and read collision */
   LVD_LVW_IRQn = 6,      /**< Low-voltage detect, low-voltage warning */
   LLWU_IRQn = 7,         /**< Low Leakage Wakeup */
   I2C0_IRQn = 8,         /**< I2C0 interrupt */
   I2C1_IRQn = 9,         /**< I2C1 interrupt */
   SPI0_IRQn = 10,        /**< SPI0 single interrupt vector for all sources */
   SPI1_IRQn = 11,        /**< SPI1 single interrupt vector for all sources */
   UART0_IRQn = 12,       /**< UART0 status and error */
   UART1_IRQn = 13,       /**< UART1 status and error */
   UART2_IRQn = 14,       /**< UART2 status and error */
   ADC0_IRQn = 15,        /**< ADC0 interrupt */
   CMP0_IRQn = 16,        /**< CMP0 interrupt */
   TPM0_IRQn = 17,        /**< TPM0 single interrupt vector for all sources */
   TPM1_IRQn = 18,        /**< TPM1 single interrupt vector for all sources */
   TPM2_IRQn = 19,        /**< TPM2 single interrupt vector for all sources */
   RTC_IRQn = 20,         /**< RTC alarm interrupt */
   RTC_Seconds_IRQn = 21, /**< RTC seconds interrupt */
   PIT_IRQn = 22,         /**< PIT single interrupt vector for all channels */
   I2S0_IRQn = 23,        /**< I2S0 Single interrupt vector for all sources */
   USB0_IRQn = 24,        /**< USB0 OTG */
   DAC0_IRQn = 25,        /**< DAC0 interrupt */
   TSI0_IRQn = 26,        /**< TSI0 interrupt */
   MCG_IRQn = 27,         /**< MCG interrupt */
   LPTMR0_IRQn = 28,      /**< LPTMR0 interrupt */
   LCD_IRQn = 29,         /**< Segment LCD interrupt */
   PORTA_IRQn = 30,       /**< PORTA pin detect */
   PORTC_PORTD_IRQn = 31  /**< Single interrupt vector for PORTC and PORTD pin detect */
} IRQn_Type;

/*!
 * @}
 */
/* end of group Interrupt_vector_numbers */

/* ----------------------------------------------------------------------------
   -- Cortex M0 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M0 Core Configuration
 * @{
 */

#define __CM0PLUS_REV 0x0000     /**< Core revision r0p0 */
#define __MPU_PRESENT 0          /**< Defines if an MPU is present or not */
#define __VTOR_PRESENT 1         /**< Defines if VTOR is present or not */
#define __NVIC_PRIO_BITS 2       /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig 0 /**< Vendor specific implementation of SysTickConfig is defined */

#include "core_cm0plus.h"   /* Core Peripheral Access Layer */
#include "system_MKL46Z4.h" /* Device specific configuration file */

/*!
 * @}
 */
/* end of group Cortex_Core_Configuration */

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */

/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
#pragma push
#pragma anon_unions
#elif defined(__CWCC__)
#pragma push
#pragma cpp_extensions on
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
#pragma language = extended
#else
#error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- ADC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/* ----------------------------------------------------------------------------
   -- ADC Register Masks
   ---------------------------------------------------------------------------- */

/* ----------------------------------------------------------------------------
   -- CMP Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/* ----------------------------------------------------------------------------
   -- CMP Register Masks
   ---------------------------------------------------------------------------- */

/* ----------------------------------------------------------------------------
   -- DAC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/* ----------------------------------------------------------------------------
   -- DAC Register Masks
   ---------------------------------------------------------------------------- */

/* ----------------------------------------------------------------------------
   -- DMA Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/* ----------------------------------------------------------------------------
   -- DMA Register Masks
   ---------------------------------------------------------------------------- */

/* ----------------------------------------------------------------------------
   -- DMAMUX Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/* ----------------------------------------------------------------------------
   -- DMAMUX Register Masks
   ---------------------------------------------------------------------------- */

/* ----------------------------------------------------------------------------
   -- GPIO Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup GPIO_Peripheral_Access_Layer GPIO Peripheral Access Layer
 * @{
 */

/** GPIO - Register Layout Typedef */
typedef struct
{
   __IO uint32_t PDOR; /**< Port Data Output Register, offset: 0x0 */
   __O uint32_t PSOR;  /**< Port Set Output Register, offset: 0x4 */
   __O uint32_t PCOR;  /**< Port Clear Output Register, offset: 0x8 */
   __O uint32_t PTOR;  /**< Port Toggle Output Register, offset: 0xC */
   __I uint32_t PDIR;  /**< Port Data Input Register, offset: 0x10 */
   __IO uint32_t PDDR; /**< Port Data Direction Register, offset: 0x14 */
} GPIO_Type;

/* ----------------------------------------------------------------------------
   -- GPIO Register Masks
   ---------------------------------------------------------------------------- */

