vsnam19/bootloader-mcp/MKL46Z4/hardware_MKL46Z4.h
/*! @name MA1 - UART Match Address Registers 1 */
#define UART0_MA1_MA_MASK (0xFFU)
#define UART0_MA1_MA_SHIFT (0U)
#define UART0_MA1_MA(x) (((uint8_t)(((uint8_t)(x)) << UART0_MA1_MA_SHIFT)) & UART0_MA1_MA_MASK)

/*! @name MA2 - UART Match Address Registers 2 */
#define UART0_MA2_MA_MASK (0xFFU)
#define UART0_MA2_MA_SHIFT (0U)
#define UART0_MA2_MA(x) (((uint8_t)(((uint8_t)(x)) << UART0_MA2_MA_SHIFT)) & UART0_MA2_MA_MASK)

/*! @name C4 - UART Control Register 4 */
#define UART0_C4_OSR_MASK (0x1FU)
#define UART0_C4_OSR_SHIFT (0U)
#define UART0_C4_OSR(x) (((uint8_t)(((uint8_t)(x)) << UART0_C4_OSR_SHIFT)) & UART0_C4_OSR_MASK)
#define UART0_C4_M10_MASK (0x20U)
#define UART0_C4_M10_SHIFT (5U)
#define UART0_C4_M10(x) (((uint8_t)(((uint8_t)(x)) << UART0_C4_M10_SHIFT)) & UART0_C4_M10_MASK)
#define UART0_C4_MAEN2_MASK (0x40U)
#define UART0_C4_MAEN2_SHIFT (6U)
#define UART0_C4_MAEN2(x) (((uint8_t)(((uint8_t)(x)) << UART0_C4_MAEN2_SHIFT)) & UART0_C4_MAEN2_MASK)
#define UART0_C4_MAEN1_MASK (0x80U)
#define UART0_C4_MAEN1_SHIFT (7U)
#define UART0_C4_MAEN1(x) (((uint8_t)(((uint8_t)(x)) << UART0_C4_MAEN1_SHIFT)) & UART0_C4_MAEN1_MASK)

/*! @name C5 - UART Control Register 5 */
#define UART0_C5_RESYNCDIS_MASK (0x1U)
#define UART0_C5_RESYNCDIS_SHIFT (0U)
#define UART0_C5_RESYNCDIS(x) (((uint8_t)(((uint8_t)(x)) << UART0_C5_RESYNCDIS_SHIFT)) & UART0_C5_RESYNCDIS_MASK)
#define UART0_C5_BOTHEDGE_MASK (0x2U)
#define UART0_C5_BOTHEDGE_SHIFT (1U)
#define UART0_C5_BOTHEDGE(x) (((uint8_t)(((uint8_t)(x)) << UART0_C5_BOTHEDGE_SHIFT)) & UART0_C5_BOTHEDGE_MASK)
#define UART0_C5_RDMAE_MASK (0x20U)
#define UART0_C5_RDMAE_SHIFT (5U)
#define UART0_C5_RDMAE(x) (((uint8_t)(((uint8_t)(x)) << UART0_C5_RDMAE_SHIFT)) & UART0_C5_RDMAE_MASK)
#define UART0_C5_TDMAE_MASK (0x80U)
#define UART0_C5_TDMAE_SHIFT (7U)
#define UART0_C5_TDMAE(x) (((uint8_t)(((uint8_t)(x)) << UART0_C5_TDMAE_SHIFT)) & UART0_C5_TDMAE_MASK)

/*!
 * @}
 */
/* end of group UART0_Register_Masks */

/* UART0 - Peripheral instance base addresses */
/** Peripheral UART0 base address */
#define UART0_BASE (0x4006A000u)
/** Peripheral UART0 base pointer */
#define UART0 ((UART0_Type *)UART0_BASE)
/** Array initializer of UART0 peripheral base addresses */
#define UART0_BASE_ADDRS \
   {                     \
      UART0_BASE         \
   }
/** Array initializer of UART0 peripheral base pointers */
#define UART0_BASE_PTRS \
   {                    \
      UART0             \
   }
/** Interrupt vectors for the UART0 peripheral type */
#define UART0_RX_TX_IRQS \
   {                     \
      UART0_IRQn         \
   }
#define UART0_ERR_IRQS \
   {                   \
      UART0_IRQn       \
   }

/*!
 * @}
 */
/* end of group UART0_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- USB Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/* ----------------------------------------------------------------------------
   -- USB Register Masks
   ---------------------------------------------------------------------------- */

/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

#endif /* _HARDWARE_MKL46Z4_H_ */
